package com.javaex.practice;

public class Ex05 {

	public static void main(String[] args) {

		/*자바소스파일(~.java)을 작성할 때 틀린것을 찾아 수정해보세요
		 * @(1) 패키지명은 일반적으로 가독성을 위해 대문자, 소문자 섞어 사용한다.(x)@
		 *  --> 패키지명은 일반적으로 변별성을 두기 위해 소문자로 도메인을 역순으로 쓴다.
		 * @(2) 클래스명은 소문자로만 구성하여 작성한다.(x)@
		 *  --> 클래스명의 첫글자는 대문자로 작성한다.
		  
		 *  (3) 자바소스파일(~.java)명과 클래스 이름은 대소문자까지 모두 동일한 단어를 사용해야된다.(ㅇ)
		   
		 * @(4) 실행문 뒤(문자의 끝)에는 반드시 (:)콜론을 사용해야 한다.(x)@
		 *  --> 반드시 (;)세미콜론을 사용해야 한다.
		 * @(5) 처음으로 실행되는 함수의 이름은 개발자가 임의로 작성해서 만든다.(x)@
		 *  --> 처음으로 실행되는 함수의 이름은 public static void main(String[] args){}를 사용한다.*/
	}

}
