package com.javaex.practice;

public class Ex06 {

	public static void main(String[] args) {

		/*아래의 설명중 틀린 것을 찾아서 수정해 보세요
		 * @(1) 변수 한개에는 동시에 여러 개의 값을 담을 수 있다.(x)@
		 *  --> 변수 한개에는 한번에 하나의 값을 담을 수 있다.
		 * @(2) 변수는 선언시에 사용한 타입의 값만 저장할 수 있다.(x)@
		 *  --> 형변환을 통해 다른 타입의 자료형으로 바꿀 수 있다.
		 * @(3) 변수는 초기값이 저장되지 않아도 읽을 수 있다.(x)@
		 *  --> 초기값이 저장되지 않으면 읽을 수 없다.
		 * @(4) 모든 자료형의 변수는 동일한 방식으로 저장된다.(x)@
		 *  --> 모든 자료형의 변수는 타입에 따라, 키워드에 따라 저장되는 데이터의 크기가 다르다.
		 * @(5) double형은 float보다 큰 수를 담을 수 있다.(x)@
		 *  --> double형과 float형은 둘다 실수형 자료를 담으며 double형이 소수점 이하의 자릿수를 float형 보다 많이 가질뿐, 큰 수를 담는 것은 아니다.
		 * @(6) int, float, char, String은 모두 기본자료형에 속한다.(x)@
		 *  --> String은 기본자료형이 아닌 참조자료형이다.
		 * @(7) final로 선언된 변수는 수정이 가능하다.(x)@
		 *  --> 수정이 불가능하다.
		 * @(8) long형은 항상 L을 붙여서 대입해야 한다.(x)@
		 *  --> int형 범위 안에서는 L을 붙이지 않아도 된다.
		   
		 * (9) float형은 항상 F을 붙여서 대입해야 한다.(ㅇ)
		 
		 * */
		
	}

}
